In [ ]:
# Pandas Columns Data Types

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from pydataset import data
mtcars = data('mtcars')
mtcarsDF = mtcars
mtcarsDF.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [34]:
rollNo = ['A01','A02','A03','A04','A05']
name   = ['Kounal', 'Tanvi', 'Kanika','Sushma', 'Dhiraj']
DOB    = ['1996/10/15', '2000/03/12', '1994/08/20', '1985/11/04', '1970/12/12']
height = [165.6, 155.2, 165, 153, 175]
degrees = [3,2,3,4,25]
gender = ['M','F',"F", 'F', 'M']
working = [True, False, True, False, True]
dataTypes =('object','string','datetime64', 'float','int','category','bool')
#dataTypes = np.dtype( [ ("rollNo", str),  ("name", object),('DOB', np.datetime64), ("height", float), 
#                       ('degrees',int), ('gender', str), ('working',bool)  ])
dataTypes = {"rollNo":str, "name" :object, 'DOB' : np.datetime64, "height" :float, 'degrees': int, 'gender': 'category','working':bool}

In [35]:
df = pd.DataFrame({'rollNo':rollNo, 'name':name, 'DOB': DOB, 'height':height, 'degrees':degrees, 'gender':gender, 'working':working})

In [36]:
df

  rollNo    name         DOB  height  degrees gender  working
0    A01  Kounal  1996/10/15   165.6        3      M     True
1    A02   Tanvi  2000/03/12   155.2        2      F    False
2    A03  Kanika  1994/08/20   165.0        3      F     True
3    A04  Sushma  1985/11/04   153.0        4      F    False
4    A05  Dhiraj  1970/12/12   175.0       25      M     True

In [37]:
print(df.dtypes)
print(df.info)

rollNo      object
name        object
DOB         object
height     float64
degrees      int64
gender      object
working       bool
dtype: object
<bound method DataFrame.info of   rollNo    name         DOB  height  degrees gender  working
0    A01  Kounal  1996/10/15   165.6        3      M     True
1    A02   Tanvi  2000/03/12   155.2        2      F    False
2    A03  Kanika  1994/08/20   165.0        3      F     True
3    A04  Sushma  1985/11/04   153.0        4      F    False
4    A05  Dhiraj  1970/12/12   175.0       25      M     True>

In [38]:
df = df.astype(dataTypes)

In [40]:
print(df.dtypes)
print(df)

rollNo             object
name               object
DOB        datetime64[ns]
height            float64
degrees             int32
gender           category
working              bool
dtype: object
  rollNo    name        DOB  height  degrees gender  working
0    A01  Kounal 1996-10-15   165.6        3      M     True
1    A02   Tanvi 2000-03-12   155.2        2      F    False
2    A03  Kanika 1994-08-20   165.0        3      F     True
3    A04  Sushma 1985-11-04   153.0        4      F    False
4    A05  Dhiraj 1970-12-12   175.0       25      M     True

In [41]:
df

  rollNo    name        DOB  height  degrees gender  working
0    A01  Kounal 1996-10-15   165.6        3      M     True
1    A02   Tanvi 2000-03-12   155.2        2      F    False
2    A03  Kanika 1994-08-20   165.0        3      F     True
3    A04  Sushma 1985-11-04   153.0        4      F    False
4    A05  Dhiraj 1970-12-12   175.0       25      M     True

In [42]:
# Select column names of object date type
sel_cols = list(df.select_dtypes(include='object'))
print(sel_cols)

['rollNo', 'name']

In [45]:
# Returns DataFrame by selected column names
df.select_dtypes(include='int')

   degrees
0        3
1        2
2        3
3        4
4       25

In [46]:
# Alternate way to get column names by data type
sel_cols = [column for column, is_type in (df.dtypes=="object").items() if is_type]
print(sel_cols)

['rollNo', 'name']

In [47]:
# Get DataFrame Column Names of a Multiple Data Types
sel_cols = list(df.select_dtypes(include=['object', 'datetime64[ns]' ]).columns)
print(sel_cols)

['rollNo', 'name', 'DOB']

In [51]:
# By Using groupby  - not working
#col = df.columns.to_series().groupby(df.dtypes).groups
#col2 = {k.name: v for k, v in col.items()}

In [52]:
#all float64 to float32
for column in df.columns:
    if df[column].dtype == 'float64':
        df[column] = df[column].astype(np.float32)
df.dtypes

rollNo             object
name               object
DOB        datetime64[ns]
height            float32
degrees             int32
gender           category
working              bool
dtype: object

In [55]:
#convert all columns to one type
df.astype('object').dtypes

rollNo     object
name       object
DOB        object
height     object
degrees    object
gender     object
working    object
dtype: object

In [57]:
columns1 = ['rollNo', 'height']
df[columns1].astype('object').dtypes
#apply(pd.datetime64)

rollNo    object
height    object
dtype: object

In [58]:
columns2 = ['height','degrees']
df[columns2].apply(pd.to_numeric).dtypes

height     float32
degrees      int32
dtype: object

In [ ]:
df[columns2].apply(pd.to_numeric).dtypes
#astype(), to_numeric(), covert_dttypes(), infer_objects() and etc

convert_dtypes() is available in Pandas DataFrame since version 1.0.0, this is the most used method as it automatically converts the column types to best possible types.
By default, when you are trying to change a column to a type that is not supported with the data, Pandas generates an error, in order to ignore error use errors param; this takes either ignore or error as value. In the below example I am converting a column that has string value to int which is not supported hence it generates an error, I used errors='ignore' to ignore the error.

In [62]:
df.convert_dtypes().dtypes
#df.convert_dtypes()

rollNo             string
name               string
DOB        datetime64[ns]
height            Float32
degrees             Int32
gender           category
working           boolean
dtype: object

In [60]:
df[columns2].apply(lambda x: x.astype('float'))

       height  degrees
0  165.600006      3.0
1  155.199997      2.0
2  165.000000      3.0
3  153.000000      4.0
4  175.000000     25.0

In [68]:
pd.to_numeric(df[('height')])  #only 1 colums

0    165.600006
1    155.199997
2    165.000000
3    153.000000
4    175.000000
Name: height, dtype: float32

In [69]:
## Convert Dataypes
df1 = pd.DataFrame({'rollNo':rollNo, 'name':name, 'DOB': DOB, 'height':height, 'degrees':degrees, 'gender':gender, 'working':working})

In [70]:
df1.dtypes

rollNo      object
name        object
DOB         object
height     float64
degrees      int64
gender      object
working       bool
dtype: object

In [73]:
df1.convert_dtypes().dtypes

rollNo      string
name        string
DOB         string
height     Float64
degrees      Int64
gender      string
working    boolean
dtype: object